---
kind: property
id: P:Autodesk.Revit.DB.Visual.Checker.CheckerSoften
source: html/5bbb8498-1f18-0cf3-eef6-f4aca5327291.htm
---
# Autodesk.Revit.DB.Visual.Checker.CheckerSoften Property

The property labeled "Soften" from the "Checker" schema.

## Syntax (C#)
```csharp
public static string CheckerSoften { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 5".